mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/s6e2c3xl.svd
        <!-- REGISTER "OCU_OCSD54" -->
        <register>
          <name>OCU_OCSD54</name>
          <description>OCU ch.4/5 Control Register D [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x122</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OFEX5" -->
            <field>
              <name>OFEX5</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(5) register value</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OFEX4" -->
            <field>
              <name>OFEX4</name>
              <description>extends the matching determination conditions of the connected FRT with the OCCP(4) register value</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM5" -->
            <field>
              <name>OEBM5</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OEBM4" -->
            <field>
              <name>OEBM4</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM5" -->
            <field>
              <name>OPBM5</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OPBM4" -->
            <field>
              <name>OPBM4</name>
              <description>sets the linked transfer settings with the FRT interrupt mask counter</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE5BUFE" -->
            <field>
              <name>OCSE5BUFE</name>
              <description>Enable buffer register function of OCSE(5)</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE4BUFE" -->
            <field>
              <name>OCSE4BUFE</name>
              <description>Enable buffer register function of OCSE(4)</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP5BUFE" -->
            <field>
              <name>OCCP5BUFE</name>
              <description>Enable buffer register function of OCCP(5)</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP4BUFE" -->
            <field>
              <name>OCCP4BUFE</name>
              <description>Enable buffer register function of OCCP(4)</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSC" -->
        <register>
          <name>OCU_OCSC</name>
          <description>OCU Control Register C [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x125</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOD5" -->
            <field>
              <name>MOD5</name>
              <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU ch.4,h.5 in combination with OCSB54.CMOD</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD4" -->
            <field>
              <name>MOD4</name>
              <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU ch.4,h.5 in combination with OCSB54.CMOD</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD3" -->
            <field>
              <name>MOD3</name>
              <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU ch.2,h.3 in combination with OCSB32.CMOD</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD2" -->
            <field>
              <name>MOD2</name>
              <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU ch.2,h.3 in combination with OCSB32.CMOD</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU ch.0,h.1 in combination with OCSB10.CMOD</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU ch.0,h.1 in combination with OCSB10.CMOD</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE0" -->
        <register>
          <name>OCU_OCSE0</name>
          <description>OCU ch.0 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCSE" -->
            <field>
              <name>OCSE</name>
              <description>specify the setting conditions of the OCU's matching detection register (IOP0)</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE1" -->
        <register>
          <name>OCU_OCSE1</name>
          <description>OCU ch.1 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCSE" -->
            <field>
              <name>OCSE</name>
              <description>specify the setting conditions of the OCU's matching detection register (IOP0/IOP1)</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE2" -->
        <register derivedFrom="OCU_OCSE0">
          <name>OCU_OCSE2</name>
          <description>OCU ch.2 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x130</addressOffset>
        </register>
