mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/s6e2c3xl.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "WC" -->
    <peripheral>
      <name>WC</name>
      <description>Watch Counter</description>
      <version>A</version>
      <groupName>WC</groupName>
      <baseAddress>0x4003A000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "WC" -->
      <interrupt>
        <name>WC</name>
        <value>48</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WCRD" -->
        <register>
          <name>WCRD</name>
          <description>Watch Counter Read Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTR" -->
            <field>
              <name>CTR</name>
              <description>Counter read bits</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCRL" -->
        <register>
          <name>WCRL</name>
          <description>Watch Counter Reload Register [BHW]</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RLC" -->
            <field>
              <name>RLC</name>
              <description>Counter reload value setting bits</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCCR" -->
        <register>
          <name>WCCR</name>
          <description>Watch Counter Control Register [BHW]</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEN" -->
            <field>
              <name>WCEN</name>
              <description>Watch counter operation enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCOP" -->
            <field>
              <name>WCOP</name>
              <description>Watch counter operating state flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CS" -->
            <field>
              <name>CS</name>
              <description>Count clock select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIE" -->
            <field>
              <name>WCIE</name>
              <description>Interrupt request enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIF" -->
            <field>
              <name>WCIF</name>
              <description>Interrupt request flag bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_SEL" -->
        <register>
          <name>CLK_SEL</name>
          <description>Clock Selection Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL_OUT" -->
            <field>
              <name>SEL_OUT</name>
              <description>Output clock selection bit</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL_IN" -->
            <field>
              <name>SEL_IN</name>
              <description>Input clock selection bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_EN" -->
        <register>
          <name>CLK_EN</name>
          <description>Division Clock Enable Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK_EN_R" -->
            <field>
              <name>CLK_EN_R</name>
              <description>Division clock enable read bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLK_EN" -->
            <field>
              <name>CLK_EN</name>
              <description>Division clock enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
