mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/s6e2c3xl.svd
        <!-- REGISTER "EPFR08" -->
        <register>
          <name>EPFR08</name>
          <description>Extended Pin Function Setting Register 08 [BHW]</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTS5S" -->
            <field>
              <name>CTS5S</name>
              <description>CTS5 Input/Output Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTS5E" -->
            <field>
              <name>RTS5E</name>
              <description>RTS5 Input/Output Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK7B" -->
            <field>
              <name>SCK7B</name>
              <description>SCK7 Input/Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT7B" -->
            <field>
              <name>SOT7B</name>
              <description>SOT7 Input/Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN7S" -->
            <field>
              <name>SIN7S</name>
              <description>SIN7 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK6B" -->
            <field>
              <name>SCK6B</name>
              <description>SCK6 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT6B" -->
            <field>
              <name>SOT6B</name>
              <description>SOT6 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN6S" -->
            <field>
              <name>SIN6S</name>
              <description>SIN6 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description>SCK5 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT5B" -->
            <field>
              <name>SOT5B</name>
              <description>SOT5 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN5S" -->
            <field>
              <name>SIN5S</name>
              <description>SIN5 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK4B" -->
            <field>
              <name>SCK4B</name>
              <description>SCK4 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT4B" -->
            <field>
              <name>SOT4B</name>
              <description>SOT4 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN4S" -->
            <field>
              <name>SIN4S</name>
              <description>SIN4 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTS4S" -->
            <field>
              <name>CTS4S</name>
              <description>CTS4 Input/Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTS4E" -->
            <field>
              <name>RTS4E</name>
              <description>RTS4 Input/Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR09" -->
        <register>
          <name>EPFR09</name>
          <description>Extended Pin Function Setting Register 09 [BHW]</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTX1E" -->
            <field>
              <name>CTX1E</name>
              <description>CTX1E Output Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRX1S" -->
            <field>
              <name>CRX1S</name>
              <description>CRX1S Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTX0E" -->
            <field>
              <name>CTX0E</name>
              <description>CTX0E Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRX0S" -->
            <field>
              <name>CRX0S</name>
              <description>CRX0S Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG2S" -->
            <field>
              <name>ADTRG2S</name>
              <description>ADTRG2 Input Select bits</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG1S" -->
            <field>
              <name>ADTRG1S</name>
              <description>ADTRG1 Input Select bits</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG0S" -->
            <field>
              <name>ADTRG0S</name>
              <description>ADTRG0 Input Select bits</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN1S" -->
            <field>
              <name>QZIN1S</name>
              <description>QZIN1S Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN1S" -->
            <field>
              <name>QBIN1S</name>
              <description>QBIN1S Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN1S" -->
            <field>
              <name>QAIN1S</name>
              <description>QAIN1S Input Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN0S" -->
            <field>
              <name>QZIN0S</name>
              <description>QZIN0S Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN0S" -->
            <field>
              <name>QBIN0S</name>
              <description>QBIN0S Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN0S" -->
            <field>
              <name>QAIN0S</name>
              <description>QAIN0S Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR10" -->
        <register>
          <name>EPFR10</name>
          <description>Extended Pin Function Setting Register 10 [BHW]</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UEA24E" -->
            <field>
              <name>UEA24E</name>
              <description>UEA24E Output Select bit</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA23E" -->
            <field>
              <name>UEA23E</name>
              <description>UEA23E Output Select bit</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA22E" -->
            <field>
              <name>UEA22E</name>
              <description>UEA22E Output Select bit</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA21E" -->
            <field>
              <name>UEA21E</name>
              <description>UEA21E Output Select bit</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA20E" -->
            <field>
              <name>UEA20E</name>
              <description>UEA20E Output Select bit</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA19E" -->
            <field>
              <name>UEA19E</name>
              <description>UEA19E Output Select bit</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA18E" -->
            <field>
              <name>UEA18E</name>
              <description>UEA18E Output Select bit</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA17E" -->
            <field>
              <name>UEA17E</name>
              <description>UEA17E Output Select bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA16E" -->
            <field>
              <name>UEA16E</name>
              <description>UEA16E Output Select bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA15E" -->
            <field>
              <name>UEA15E</name>
              <description>UEA15E Output Select bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA14E" -->
            <field>
              <name>UEA14E</name>
              <description>UEA14E Output Select bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA13E" -->
            <field>
              <name>UEA13E</name>
              <description>UEA13E Output Select bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA12E" -->
            <field>
              <name>UEA12E</name>
              <description>UEA12E Output Select bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA11E" -->
            <field>
              <name>UEA11E</name>
              <description>UEA11E Output Select bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA10E" -->
            <field>
              <name>UEA10E</name>
              <description>UEA10E Output Select bit</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA09E" -->
            <field>
              <name>UEA09E</name>
              <description>UEA09E Output Select bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA08E" -->
            <field>
              <name>UEA08E</name>
              <description>UEA08E Output Select bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEAOOE" -->
            <field>
              <name>UEAOOE</name>
              <description>UEAOOE Output Select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS7E" -->
            <field>
              <name>UECS7E</name>
              <description>UECS7E Output Select bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS6E" -->
            <field>
              <name>UECS6E</name>
              <description>UECS6E Output Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS5E" -->
            <field>
              <name>UECS5E</name>
              <description>UECS5E Output Select bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS4E" -->
            <field>
              <name>UECS4E</name>
              <description>UECS4E Output Select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS3E" -->
            <field>
              <name>UECS3E</name>
              <description>UECS3E Output Select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS2E" -->
            <field>
              <name>UECS2E</name>
              <description>UECS2E Output Select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS1E" -->
            <field>
              <name>UECS1E</name>
              <description>UECS1E Output Select bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEFLSE" -->
            <field>
              <name>UEFLSE</name>
              <description>UEFLSE Output Select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEOEXE" -->
            <field>
              <name>UEOEXE</name>
              <description>UEOEXE Output Select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQME" -->
            <field>
              <name>UEDQME</name>
              <description>UEDQME Output Select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEWEXE" -->
            <field>
              <name>UEWEXE</name>
              <description>UEWEXE Output Select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECLKE" -->
            <field>
              <name>UECLKE</name>
              <description>UECLKE Output Select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDTHB" -->
            <field>
              <name>UEDTHB</name>
              <description>UEDTHB Input/Output Select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDEFB" -->
            <field>
              <name>UEDEFB</name>
              <description>UEDEFB Input/Output Select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
